# questions.py

DEFAULT_QUESTIONS = [
    # Вопрос 1 – свободный
    {
        "text": "Твоё имя?",
        "type": "free"
    },
    # Вопрос 2 – свободный
    {
        "text": "Твой возраст?",
        "type": "free"
    },
    # Вопрос 3
    {
        "text": "У тебя есть отношения?",
        "options": ["Да", "Нет"]
    },
    # Вопрос 4
    {
        "text": "Ты когда-то изменял/а?",
        "options": ["Да", "Нет"]
    },
    # Вопрос 5
    {
        "text": "У тебя есть лучший друг или подруга?",
        "options": ["Да", "Нет"]
    },
    # Вопрос 6
    {
        "text": "Тебе хотелось когда-то с ним/ней заняться сексом?",
        "options": ["Да", "Нет"]
    },
    # Вопрос 7
    {
        "text": "Ты смотришь порно?",
        "options": ["Да", "Нет"]
    },
    # Вопрос 8
    {
        "text": "Какое порно тебе нравится?",
        "options": ["Лесби", "Геи", "Групповое", "БДСМ", "Межрассовый", "Обычный"]
    },
    # Вопрос 9
    {
        "text": "Ты мастурбируешь?",
        "options": ["Да", "Нет"]
    },
    # Вопрос 10
    {
        "text": "Как часто ты мастурбируешь?",
        "options": ["1 раз в день", "2 раза в неделю", "1 раз в месяц", "Несколько раз в день"]
    },
    # Вопрос 11
    {
        "text": "Что ты бы хотел/хотела попробовать в сексе?",
        "options": ["МЖМ", "ЖМЖ", "БДСМ", "Однополый"]
    },
    # Вопрос 12
    {
        "text": "Ты готов к неожиданным вопросам?",
        "options": ["Да, всегда готов"]
    }
]
